{
  "separator": {
    "projects": "Projetos",
    "aboutMe": "Sobre mim",
    "contact": "Contatos",
    "technologies": "Tecnologias"
  },
  "resume": {
    "hardSkills": "Mais de 4 anos de experiência em desenvolvimento de websites, APIs, serviços e scripts, com as tecnologias mais utilizadas do mercado, incluindo React, Golang e NodeJS. Destaco-me pela excelente comunicação e capacidade de aprendizado rápido, sempre buscando inovar e otimizar soluções.",
    "softSkills": "Experiência em aplicações em produção com grande fluxo de requisições e consumo de dados e contato direto com o cliente."
  },
  "aboutMe": {
    "development": {
      "title": "Desenvolvimento",
      "content": "Durante minha jornada na carreira de Desenvolvimento, experienciei diversos tipos de desafios e projetos. Desde web scrapping até gerenciamento de Logs, trabalhei com as mais diversas linguagens e frameworks, como React, Golang, Python, NodeJS, NextJS, NextJS e outros. Para o gerenciamento de Dados tenho conhecimento em bancos relacionais e não relacionais como MySQL, PostgreSQL, MongoDB e Redis para dados em cache."
    },
    "design": {
      "title": "Design",
      "content": "Devido à minha experiência prévia como designer, reproduzir interfaces pixel perfect é uma das minhas maiores qualidades como desenvolvedor front end. Enquanto desenvolvedor, entendo que meu cliente pode não ser da área da tecnologia, então tento transparecer profissionalidade através da imagem."
    },
    "communication": {
      "title": "Comunicação",
      "content": "Um dos meus maiores aprendizados da carreira foi a comunicação. Tanto para falar com outros desenvolvedores quanto para apresentar o que o time fez até negociar estimativa de entrega de projetos. A comunicação é a chave para um bom ambiente de trabalho."
    }
  },
  "contact": {
    "title": "Entre em Contato",
    "content": "Se você tem uma proposta de emprego ou gostaria de discutir oportunidades profissionais, por favor, preencha o formulário abaixo. Vou revisar sua mensagem e responder o mais breve possível. Estou ansioso para explorar possíveis colaborações!",
    "form": {
      "name": "Nome",
      "email": "Email",
      "subject": "Assunto",
      "message": "Mensagem",
      "send": "Enviar",
      "sending": "Enviando...",
      "response": {
        "success": "E-mail enviado com sucesso!",
        "error": "Ocorreu um erro ao enviar o e-amil. Por favor, tente novamente mais tarde."
      },
      "error": {
        "name": {
          "required": "Por favor, insira seu nome.",
          "maxLength": "O nome deve ter menos de 30 caracteres."
        },
        "subject": {
          "required": "Por favor, insira um assunto.",
          "maxLength": "O assunto deve ter menos de 60 caracteres."
        },
        "email": "Por favor, insira um email válido.",
        "message": "Por favor, insira uma mensagem."
      }
    }
  },
  "technologies": {
    "title": "Tecnologias",
    "content": "Aqui estão algumas das tecnologias que tenho experiência e que posso te ajudar a implementar em seu projeto."
  }
}